<template>
    <Content :style="{padding: '0 200px'}">
        <h1 class="big-title">
            ACM介绍
        </h1>
        <Divider/>
        <h1>简介</h1>
        <Card style="width:100%; margin-top: 10px;">
            <Row>
                <Col span="20" style="height: 100%;">
                ACM国际大学生程序设计竞赛（英文全称：ACM International Collegiate Programming Contest（简称ACM-ICPC或ICPC））是由国际计算机协会（ACM）主办的，一项旨在展示大学生创新能力、团队精神和在压力下编写程序、分析和解决问题能力的年度竞赛。
                经过近40年的发展，ACM国际大学生程序设计竞赛已经发展成为全球最具影响力的大学生程序设计竞赛。在2018年，ACM（国际计算机协会）已经宣布不再赞助ICPC竞赛，赛事目前由方正集团赞助。
                </Col>
                <Col span="4">
                    <img src="../../assets/detail-logo.png" width="100%"/>
                </Col>
            </Row>
        </Card>
        <br>
        <h1>ACM历史</h1>
        <Card style="width:100%; margin-top: 10px;">
            ACM国际大学生程序设计竞赛的历史可以上溯到1970年。作为一种全新的发现和培养计算机科学顶尖学生的方式，竞赛很快得到美国和加拿大各大学的积极响应。1977年，在ACM计算机科学会议期间举办了首次总决赛，并演变成为一年一届的多国参与的国际性比赛。
            <br>
            在赛事的早期，冠军多为美国和加拿大的大学获得。而进入1990年代后期以来，俄罗斯和其它一些东欧国家的大学连夺数次冠军。来自中国大陆的上海交通大学代表队则在美国夏威夷的第26届、上海的第29届和在哈尔滨的第34届的全球总决赛上三夺冠军，浙江大学参赛队在第35届ACM国际大学生程序设计竞赛全球总决赛荣获冠军，成为除上海交通大学之外唯一获得ACM国际大学生程序设计竞赛全球总决赛冠军的亚洲高校。赛事的竞争格局已经由最初的北美大学一枝独秀演变成当前的亚欧对抗局面。
        </Card>
        <br>
        <h1>竞赛奖励</h1>
        <Card style="width:100%; margin-top: 10px;">
            区域赛一般分别按10%，20%，30%的比例颁发金，银，铜奖，即一般情况（120队伍，若队伍容量扩充则获奖数量也按比例增多）有12支队伍获金牌，24支队伍获银牌，36支队伍获铜牌，其余为优胜奖。
            <br>
            2010年亚洲区域赛中国大陆5大赛区由阿里巴巴公司赞助，获得金牌的选手可以享受绿色通道，进入阿里巴巴实习或参加工作。
            <br>
            2012年亚洲区域赛中国大陆5大赛区由华为公司赞助，有奖金：冠5000、亚3000、季2000，非冠亚季的金牌1200，FB 800（First Blood，指全场第一个解答出某道题），最佳女队800，顽强拼搏500（指全场最后一个AC，且只AC1道题的队伍）。
            <br>
            总决赛前十名的队伍将得到高额奖学金：第一名奖金为12000美元，第二名奖金为6000美元，第三名奖金为3000美元，第四名至第十名将各得到1500美元。除此之外还将承认北美冠军、欧洲冠军、南太平洋冠军及亚洲冠军。
        </Card>
        <br>
        <h1>奖励规则</h1>
        <Card style="width:100%; margin-top: 10px;">
            ACM亚洲区预选赛颁发两个系列的获奖证书：
            <br>
            1、金、银、铜奖证书，按排名颁发，颁奖比例分别为参赛队数的10%，20%和30%。
            <br>
            2、ICPC排名证书，按学校排序，每个学校只取排序最高的队进行排序，其余队和下一所学校的队并列排名，学校排名前30名且获得铜奖的队颁发排名证书。
        </Card>

    </Content>
</template>

<script lang="ts">
import Vue from 'vue'


export default Vue.extend({
    
})
</script>
